In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import warnings 
warnings.filterwarnings('ignore')

In [2]:
ds= pd.read_csv('WorldCupMatches.csv')

In [3]:
ds.head()

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
0,1930.0,13 Jul 1930 - 15:00,Group 1,Pocitos,Montevideo,France,4.0,1.0,Mexico,,4444.0,3.0,0.0,LOMBARDI Domingo (URU),CRISTOPHE Henry (BEL),REGO Gilberto (BRA),201.0,1096.0,FRA,MEX
1,1930.0,13 Jul 1930 - 15:00,Group 4,Parque Central,Montevideo,USA,3.0,0.0,Belgium,,18346.0,2.0,0.0,MACIAS Jose (ARG),MATEUCCI Francisco (URU),WARNKEN Alberto (CHI),201.0,1090.0,USA,BEL
2,1930.0,14 Jul 1930 - 12:45,Group 2,Parque Central,Montevideo,Yugoslavia,2.0,1.0,Brazil,,24059.0,2.0,0.0,TEJADA Anibal (URU),VALLARINO Ricardo (URU),BALWAY Thomas (FRA),201.0,1093.0,YUG,BRA
3,1930.0,14 Jul 1930 - 14:50,Group 3,Pocitos,Montevideo,Romania,3.0,1.0,Peru,,2549.0,1.0,0.0,WARNKEN Alberto (CHI),LANGENUS Jean (BEL),MATEUCCI Francisco (URU),201.0,1098.0,ROU,PER
4,1930.0,15 Jul 1930 - 16:00,Group 1,Parque Central,Montevideo,Argentina,1.0,0.0,France,,23409.0,0.0,0.0,REGO Gilberto (BRA),SAUCEDO Ulises (BOL),RADULESCU Constantin (ROU),201.0,1085.0,ARG,FRA

In [4]:
ds.shape

(4572, 20)

In [5]:
ds.index

RangeIndex(start=0, stop=4572, step=1)

In [6]:
ds.columns

Index(['Year', 'Datetime', 'Stage', 'Stadium', 'City', 'Home Team Name',
       'Home Team Goals', 'Away Team Goals', 'Away Team Name',
       'Win conditions', 'Attendance', 'Half-time Home Goals',
       'Half-time Away Goals', 'Referee', 'Assistant 1', 'Assistant 2',
       'RoundID', 'MatchID', 'Home Team Initials', 'Away Team Initials'],
      dtype='object')

In [7]:
ds.isnull().sum()

Year                    3720
Datetime                3720
Stage                   3720
Stadium                 3720
City                    3720
Home Team Name          3720
Home Team Goals         3720
Away Team Goals         3720
Away Team Name          3720
Win conditions          3720
Attendance              3722
Half-time Home Goals    3720
Half-time Away Goals    3720
Referee                 3720
Assistant 1             3720
Assistant 2             3720
RoundID                 3720
MatchID                 3720
Home Team Initials      3720
Away Team Initials      3720
dtype: int64

In [8]:
ds['Year'].mean()

1985.0892018779343

In [9]:
ds['Year'].tail()

4567   NaN
4568   NaN
4569   NaN
4570   NaN
4571   NaN
Name: Year, dtype: float64

In [10]:
ds['Year'].replace(np.NaN,ds['Year'].mean()).tail()

4567    1985.089202
4568    1985.089202
4569    1985.089202
4570    1985.089202
4571    1985.089202
Name: Year, dtype: float64

In [11]:
d= pd.read_csv('Data.csv')

In [12]:
d

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [13]:
m= int(d['Age'].mean())
d['Age'].replace(np.NaN,m ,inplace=True)
d['Salary'].replace(np.NaN, d['Salary'].mean(),inplace=True)
d

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [14]:
x=d.iloc[:,:-1].values

In [15]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.0, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [16]:
from sklearn.preprocessing import LabelEncoder

In [17]:
labelencoder= LabelEncoder()

In [18]:
x[:,0]= labelencoder.fit_transform(x[:,0])

In [19]:
x

array([[0, 44.0, 72000.0],
       [2, 27.0, 48000.0],
       [1, 30.0, 54000.0],
       [2, 38.0, 61000.0],
       [1, 40.0, 63777.77777777778],
       [0, 35.0, 58000.0],
       [2, 38.0, 52000.0],
       [0, 48.0, 79000.0],
       [1, 50.0, 83000.0],
       [0, 37.0, 67000.0]], dtype=object)

In [20]:
from sklearn.preprocessing import OneHotEncoder

In [21]:
x

array([[0, 44.0, 72000.0],
       [2, 27.0, 48000.0],
       [1, 30.0, 54000.0],
       [2, 38.0, 61000.0],
       [1, 40.0, 63777.77777777778],
       [0, 35.0, 58000.0],
       [2, 38.0, 52000.0],
       [0, 48.0, 79000.0],
       [1, 50.0, 83000.0],
       [0, 37.0, 67000.0]], dtype=object)

In [22]:
onehotencoder= OneHotEncoder(categorical_features=[0])

In [23]:

x= onehotencoder.fit_transform(x)

/home/srishti/anaconda3/lib/python3.7/site-packages/sklearn/preprocessing/_encoders.py:392: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

In [24]:
dummy= pd.get_dummies(d['Country'])
dummy

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0

In [42]:
d=pd.concat([d,dummy],axis=1)

In [43]:
d

   Country   Age        Salary Purchased  France  Germany  Spain
0   France  44.0  72000.000000        No       1        0      0
1    Spain  27.0  48000.000000       Yes       0        0      1
2  Germany  30.0  54000.000000        No       0        1      0
3    Spain  38.0  61000.000000        No       0        0      1
4  Germany  40.0  63777.777778       Yes       0        1      0
5   France  35.0  58000.000000       Yes       1        0      0
6    Spain  38.0  52000.000000        No       0        0      1
7   France  48.0  79000.000000       Yes       1        0      0
8  Germany  50.0  83000.000000        No       0        1      0
9   France  37.0  67000.000000       Yes       1        0      0

In [44]:
d.drop(['Country'],axis=1)

    Age        Salary Purchased  France  Germany  Spain
0  44.0  72000.000000        No       1        0      0
1  27.0  48000.000000       Yes       0        0      1
2  30.0  54000.000000        No       0        1      0
3  38.0  61000.000000        No       0        0      1
4  40.0  63777.777778       Yes       0        1      0
5  35.0  58000.000000       Yes       1        0      0
6  38.0  52000.000000        No       0        0      1
7  48.0  79000.000000       Yes       1        0      0
8  50.0  83000.000000        No       0        1      0
9  37.0  67000.000000       Yes       1        0      0

In [45]:
from sklearn.model_selection import train_test_split

In [48]:
y=d['France']
X_train,X_test,Y_train,Y_test=train_test_split(x,y,test_size=0.2)

In [53]:
print(X_train)

  (0, 4)	52000.0
  (0, 3)	38.0
  (0, 2)	1.0
  (1, 4)	72000.0
  (1, 3)	44.0
  (1, 0)	1.0
  (2, 4)	67000.0
  (2, 3)	37.0
  (2, 0)	1.0
  (3, 4)	61000.0
  (3, 3)	38.0
  (3, 2)	1.0
  (4, 4)	83000.0
  (4, 3)	50.0
  (4, 1)	1.0
  (5, 4)	79000.0
  (5, 3)	48.0
  (5, 0)	1.0
  (6, 4)	63777.77777777778
  (6, 3)	40.0
  (6, 1)	1.0
  (7, 4)	54000.0
  (7, 3)	30.0
  (7, 1)	1.0

In [54]:
print(X_test)

  (0, 4)	48000.0
  (0, 3)	27.0
  (0, 2)	1.0
  (1, 4)	58000.0
  (1, 3)	35.0
  (1, 0)	1.0

In [55]:
print(Y_train)

6    0
0    1
9    1
3    0
8    0
7    1
4    0
2    0
Name: France, dtype: uint8

In [56]:
print(Y_test)

1    0
5    1
Name: France, dtype: uint8

In [59]:
d

   Country   Age        Salary Purchased  France  Germany  Spain
0   France  44.0  72000.000000        No       1        0      0
1    Spain  27.0  48000.000000       Yes       0        0      1
2  Germany  30.0  54000.000000        No       0        1      0
3    Spain  38.0  61000.000000        No       0        0      1
4  Germany  40.0  63777.777778       Yes       0        1      0
5   France  35.0  58000.000000       Yes       1        0      0
6    Spain  38.0  52000.000000        No       0        0      1
7   France  48.0  79000.000000       Yes       1        0      0
8  Germany  50.0  83000.000000        No       0        1      0
9   France  37.0  67000.000000       Yes       1        0      0

In [60]:
d= pd.read_csv('Data.csv')
d

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [66]:
from sklearn.preprocessing import StandardScaler
standard_x= StandardScaler()

In [71]:
X_train= standard_x.fit_transform(X_train)
X_test= standard_x.fit_transform(X_test)

ValueError: Cannot center sparse matrices: pass `with_mean=False` instead. See docstring for motivation and alternatives.